## Production: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 4 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                          NAME                                           |
|--------|-----------------------------------------------------------------------------------------|
| add    | `aws_acm_certificate_validation.ai_answers`                                             |
|        | `aws_route53_record.ai_answers_certificate_validation[&quot;*.ai-answers.alpha.canada.ca&quot;]`  |
|        | `aws_route53_record.ai_answers_certificate_validation[&quot;*.reponses-ia.alpha.canada.ca&quot;]` |
|        | `aws_route53_record.ai_answers_certificate_validation[&quot;ai-answers.alpha.canada.ca&quot;]`    |
| delete | `aws_acm_certificate.ai_answers`                                                        |
| update | `aws_lb.ai_answers`                                                                     |
|        | `aws_lb_listener.ai_answers_listener`                                                   |
|        | `aws_lb_listener_rule.https_reponses`                                                   |
|        | `aws_lb_target_group.ai_answers`                                                        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_acm_certificate.ai_answers (deposed object d4309492) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_acm_certificate" "ai_answers" {
      - arn                       = "arn:aws:acm:ca-central-1:730335533085:certificate/ecd4c898-d047-477c-8765-e46c6ea753a7" -> null
      - domain_name               = "ai-answers.alpha.canada.ca" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "*.ai-answers.alpha.canada.ca"
              - resource_record_name  = "_5707bb93bbcbb5aed0be674ebaa71764.ai-answers.alpha.canada.ca."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_5311683aec2b649de50998c8727cff32.xlfgrmvvlj.acm-validations.aws."
            },
          - {
              - domain_name           = "ai-answers.alpha.canada.ca"
              - resource_record_name  = "_5707bb93bbcbb5aed0be674ebaa71764.ai-answers.alpha.canada.ca."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_5311683aec2b649de50998c8727cff32.xlfgrmvvlj.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:ca-central-1:730335533085:certificate/ecd4c898-d047-477c-8765-e46c6ea753a7" -> null
      - key_algorithm             = "RSA_2048" -> null
      - not_after                 = "2026-09-12T23:59:59Z" -> null
      - not_before                = "2025-08-14T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - renewal_eligibility       = "ELIGIBLE" -> null
      - renewal_summary           = [] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "*.ai-answers.alpha.canada.ca",
          - "ai-answers.alpha.canada.ca",
        ] -> null
      - tags                      = {
          - "CostCentre" = "ai-answers-prod"
          - "Terraform"  = "true"
        } -> null
      - tags_all                  = {
          - "CostCentre" = "ai-answers-prod"
          - "Terraform"  = "true"
        } -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null
        # (2 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate_validation.ai_answers will be created
  + resource "aws_acm_certificate_validation" "ai_answers" {
      + certificate_arn         = "arn:aws:acm:ca-central-1:730335533085:certificate/08f60e83-1cc4-4255-bb17-a3c726ea0861"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_lb.ai_answers will be updated in-place
  ~ resource "aws_lb" "ai_answers" {
        id                                                           = "arn:aws:elasticloadbalancing:ca-central-1:730335533085:loadbalancer/app/ai-answers-lb/45a1a79ce3ad38fd"
        name                                                         = "ai-answers-lb"
      ~ tags                                                         = {
            "CostCentre"   = "ai-answers-prod"
          + "ForceRefresh" = "2025-08-14"
            "Terraform"    = "true"
        }
      ~ tags_all                                                     = {
          + "ForceRefresh" = "2025-08-14"
            # (2 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lb_listener.ai_answers_listener will be updated in-place
  ~ resource "aws_lb_listener" "ai_answers_listener" {
      ~ certificate_arn                                                       = "arn:aws:acm:ca-central-1:730335533085:certificate/ecd4c898-d047-477c-8765-e46c6ea753a7" -> "arn:aws:acm:ca-central-1:730335533085:certificate/08f60e83-1cc4-4255-bb17-a3c726ea0861"
        id                                                                    = "arn:aws:elasticloadbalancing:ca-central-1:730335533085:listener/app/ai-answers-lb/45a1a79ce3ad38fd/9f727c16e83dbaef"
      ~ tags                                                                  = {
            "CostCentre"   = "ai-answers-prod"
          + "ForceRefresh" = "2025-08-14"
            "Terraform"    = "true"
        }
      ~ tags_all                                                              = {
          + "ForceRefresh" = "2025-08-14"
            # (2 unchanged elements hidden)
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lb_listener_rule.https_reponses will be updated in-place
  ~ resource "aws_lb_listener_rule" "https_reponses" {
        id           = "arn:aws:elasticloadbalancing:ca-central-1:730335533085:listener-rule/app/ai-answers-lb/45a1a79ce3ad38fd/9f727c16e83dbaef/f47ed947cb7e022e"
      ~ tags         = {
          + "CostCentre"   = "ai-answers-prod"
          + "ForceRefresh" = "2025-08-14"
          + "Terraform"    = "true"
        }
      ~ tags_all     = {
          + "ForceRefresh" = "2025-08-14"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lb_target_group.ai_answers will be updated in-place
  ~ resource "aws_lb_target_group" "ai_answers" {
        id                                 = "arn:aws:elasticloadbalancing:ca-central-1:730335533085:targetgroup/ai-answers/2f1a52f458a8f22f"
        name                               = "ai-answers"
      ~ tags                               = {
            "CostCentre"   = "ai-answers-prod"
          + "ForceRefresh" = "2025-08-14"
            "Terraform"    = "true"
        }
      ~ tags_all                           = {
          + "ForceRefresh" = "2025-08-14"
            # (2 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_route53_record.ai_answers_certificate_validation["*.ai-answers.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "ai_answers_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_5707bb93bbcbb5aed0be674ebaa71764.ai-answers.alpha.canada.ca"
      + records         = [
          + "_5311683aec2b649de50998c8727cff32.xlfgrmvvlj.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z03953002E573M7I51UTU"
    }

  # aws_route53_record.ai_answers_certificate_validation["*.reponses-ia.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "ai_answers_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_1d0d8a2a7dded94a02d05e9b8ebfe919.reponses-ia.alpha.canada.ca"
      + records         = [
          + "_27e44abc303a70a8d7e6aaa65c5c2047.xlfgrmvvlj.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z05616242JY6JM0CDTYJ6"
    }

  # aws_route53_record.ai_answers_certificate_validation["ai-answers.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "ai_answers_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_5707bb93bbcbb5aed0be674ebaa71764.ai-answers.alpha.canada.ca"
      + records         = [
          + "_5311683aec2b649de50998c8727cff32.xlfgrmvvlj.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z03953002E573M7I51UTU"
    }

Plan: 4 to add, 4 to change, 1 to destroy.

Changes to Outputs:
  ~ lb_listener                 = {
      ~ certificate_arn                                                       = "arn:aws:acm:ca-central-1:730335533085:certificate/ecd4c898-d047-477c-8765-e46c6ea753a7" -> "arn:aws:acm:ca-central-1:730335533085:certificate/08f60e83-1cc4-4255-bb17-a3c726ea0861"
        id                                                                    = "arn:aws:elasticloadbalancing:ca-central-1:730335533085:listener/app/ai-answers-lb/45a1a79ce3ad38fd/9f727c16e83dbaef"
      ~ tags                                                                  = {
            CostCentre   = "ai-answers-prod"
          + ForceRefresh = "2025-08-14"
            Terraform    = "true"
        }
      ~ tags_all                                                              = {
          + ForceRefresh = "2025-08-14"
            # (2 unchanged attributes hidden)
        }
        # (29 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
